app/controllers/friends_controller.rb

SELECT "friends".* FROM "friends"
---
  def index
    @friends = Friend.all

INSERT INTO "friends" ("first_name", "email", "phone", "twitter", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    #@friend = Friend.new(friend_params) #zmiana
    @friend = current_user.friends.build(friend_params)

    respond_to do |format|
      if @friend.save

UPDATE "friends" SET "updated_at" = ?, "user_id" = ? WHERE "friends"."id" = ?  [["updated_at", "2022-10-25 11:10:48.568548"], ["user_id", 29], ["id", 16]]
---
  def update
    respond_to do |format|
      if @friend.update(friend_params)

DELETE FROM "friends" WHERE "friends"."id" = ?  [["id", 20]]
---
  def destroy
    @friend.destroy

SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = ? AND "friends"."id" = ? LIMIT ?  [["user_id", 29], ["id", 19], ["LIMIT", 1]]
---
  def correct_user
    @friend = current_user.friends.find_by(id: params[:id])

SELECT "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
---
    def set_friend
      @friend = Friend.find(params[:id])