app/controllers/notes_controller.rb

SELECT "notes".* FROM "notes"
---
  def index
    @notes = Note.all

INSERT INTO "notes" ("tekst", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["tekst", "qwerty"], ["created_at", "2022-11-08 10:38:49.419468"], ["updated_at", "2022-11-08 10:38:49.419468"], ["user_id", 33]]
---
  def create
    #@note = Note.new(note_params)
    @note = current_user.notes.build(note_params)

    respond_to do |format|
      if @note.save

UPDATE "notes" SET "tekst" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["tekst", "zxcvbnm sadsdadsf rttrrtrtrreret"], ["updated_at", "2022-11-08 11:59:53.371599"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @note.update(note_params)

DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 4]]
---
  def destroy
    @note.destroy

SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_note
      @note = Note.find(params[:id])

SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = ? AND "notes"."id" = ? LIMIT ?  [["user_id", 33], ["id", 4], ["LIMIT", 1]]
---
    def correct_user
      @note = current_user.notes.find_by(id: params[:id])